Revit 2027 API
Rebar.GetRebarSplice Method
 Gets the rebar splice at the specified bar end - 0 for start, 1 for end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarSplice GetRebarSplice(
	int barEnd
)
Public Function GetRebarSplice (
	barEnd As Integer
) As RebarSplice
public:
RebarSplice^ GetRebarSplice(
	int barEnd
)
member GetRebarSplice :
        barEnd : int -> RebarSplice
Parameters
barEnd Int32
 The bar end for which the rebar splice is needed - 0 for start, 1 for end.
Return Value
RebarSplice
 Returns the rebar splice at the specified bar end - 0 for start, 1 for end.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barEnd must be 0 or 1.
Remarks
 In order to splice a rebar or unify existing spliced rebars there are utility functions in RebarSpliceUtils class.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace